```
stateDiagram-v2

10 --> 122
10 --> 132
10 --> 142
10 --> 152
122 --> 122a
note right of 122a
1. Бакеев Тимур
2. Балаганский Дмитрий
3. Вайс Максим
4. Воронин Вячеслав
5. Давыдов Никита
6. Демьянчук Андрей
7. Егоров Юрий
8. Иванов Николай
9. Козлова Карина
10. Кукина Анна
11. Малахов Кирилл
12. Никитин Павел
13. Осипов Вячеслав
    end note
122 --> 122b
note right of 122b
1. Пешков Матвей
2. Пирогов Егор
3. Семёнов Алексей
4. Силков Александр
5. Скачкаускас Матвей
6. Соболев Егор
7. Степанов Михаил
8. Толстов Илья
9. Фурсова Анна
10. Хузеев Кирилл
11. Шабанова Галина
12. Шаманина Виктория
13. Шандриков Виктор
14. Эков Илья Андреевич
    end note
132 --> 132b
note right of 132b
1. Назарова Юлия
2. Новиков Михаил
3. Одегов Илья
4. Прохоров Арсений
5. Пустовалов Михаил
6. Рейс Ангелина
7. Романов Сергей
8. Рощупкин Максим
9. Трофимова Анастасия
10. Тюляндина Яна
11. Федоров Артем
12. Худобец Надежда
13. Черноскутов Артем
14. Шабалина Алёна
    end note
142 --> 142a
note right of 142a
1. Аверин Владимир
2. Барабанова Наталия
3. Баранова Софья
5. Истомина Полина
6. Каллас Данил
7. Клименов Илья
8. Корзун Никита
9. Мельник Ульяна
10. Могильный Борислав
11. Морозов Никита
14. Шелепов Артём
    end note
142 --> 142b
note right of 142b
1. Бельков Вячеслав
2. Наумов Сергей
3. Петров Роман
4. Пипина Алина
5. Попова Анастасия
6. Потапова Софья
7. Рибсам Эдуард
8. Сподина Анастасия
9. Стариков Арсений
10. Трущук Артём
11. Тухватулин Ахат
12. Уйманова Валерия
13. Шендеров Владислав
14. Шипачев Никита
    end note
152 --> 152a
note right of 152a
1. Баянова Дарья
2. Бисеркин Максим
3. Блитенков Никита
4. Дарсания София
5. Демина Ирина
6. Думчева София
7. Залозный Степан
8. Зима Мария
9. Иванова Татьяна
10. Каймонова Анастасия
11. Калиниченко Кристина
12. Кондрачук Мария
13. Лавров Данил
14. Чойнзонов Алексей
    end note
152 --> 152b
note right of 152b
1. Лецкий Даниил
2. Лукиева Алина
3. Матвеева Маргарита
4. Молодых Виктория
5. Орлова София
6. Постернак Алёна
7. Скирневский Павел
8. Солодкова Ксения
9. Трей Алина
10. Тхорик Денис
11. Шипенок Лада
12. Шматова Юлиана
13. Шукшина Валерия
    end note
```

```
stateDiagram-v2
11 --> 021
11 --> 031
11 --> 041
11 --> 051
021 --> 021a
021 --> 021b
031 --> 031a
031 --> 031b
041 --> 041b
051 --> 051b
note right of 021a
1. Андрейкина Арина
2. Владимиров Алексей
3. Кислицина Вера
4. Крамаренко Матвей
5. Мильке Евгений
6. Никонов Артём
7. Олефиренко Тимофей
8. Остахов Денис
9. Погодаева Алиса
10. Потапова Екатерина
11. Пшеничников Максим
12. Романчук Артемий
13. Сафьянников Артём
14. Усачев Сергей
15. Черников Степан
    end note
note right of 021b
1. Верховский Михаил
2. Галанов Никита
3. Голинский Илья
4. Караченцев Николай
5. Крыжановский Никита
6. Куць Александр
7. Лебедева Виктория
8. Рассказов Никита
9. Тарасевич Данил
10. Тимохина Валерия
11. Черкасов Артём
12. Шветко Роман
    end note
note right of 031a
1. Бозоян Овсеп
2. Ван Екатерина
3. Громышев Сергей
4. Зарубин Леонид
5. Иноземцев Кирилл
6. Козярская Ульяна
7. Марухин Егор
8. Новокшонов Тимофей
9. Обходский Дмитрий
10. Солтаганова Анжелика
11. Тихий Иван
12. Шамова Виктория
13. Шнайдер Артём
14. Шпаченко Елена
    end note
note right of 031b
1. Ермакова Анна
2. Жданов Лев
3. Жумангалиева Карина
4. Калашников Кирилл
5. Левченко Юлия
6. Медведев Глеб
7. Пинжина Полина
8. Рыбак Виталий
9. Сухорослов Геннадий
10. Уткин Никита
11. Ухов Валерий
12. Шишигин Егор
13. Шумилов Евгений
14. Юдинцева Алиса
    end note
note right of 041b
1. Бричков Никита
2. Вологжанин Артемий
3. Конева Полина
4. Кузнецова Ульяна
5. Куликова Ольга
6. Лизунова Варвара
7. Мартюшев Егор
8. Нестеров Ярослав
9. Пичугин Сергей
10. Чепкасов Иван
11. Чмыхало Михаил
12. Энс Алина
    end note
note right of 051b
1. Голубцова Александра
2. Дегтярев Данила
3. Коченовский Роман
4. Кутенева Таисия
5. Левковский Александр
6. Ложанова Наталья
7. Медведева Анастасия
8. Миронов Максим
9. Пергаев Александр
10. Скипа Макар
11. Таратунина Ангелина
12. Чередникова Светлана
    end note
```
```
Alice->>+John: Hello John, how are you?
    Alice->>+John: John, can you hear me?
    John->>-Alice: Hi Alice, I can hear you!
    John-->>-Alice: I feel great!
```

```
Игры
Создавать
Играть
Организовывать

Д/З
Видео смотреть
Конспекты писать

Сайт лицея
ссылки
видео
страницы
информация

Роботехника
EV3
Arduino
Raspberry

Проект
Журнальные
Железные

Уроки
темы
практика
задачи
оценки
формы

ЕГЭ
код
алгоритмы
блоки
тесты

Спецкурс
Задачи ЕГЭ
другие среды программирования
Задача
Курсы сириус
олимпиадные

it-навыки
графика
кодинг
администрирование
навыки работы на пк

Научно-методическая работы
Разработки для детей
программы

Бд
формы КР СР
мониторинг
обучающие тренажеры
работа в реальном времени
алиса

```
